def sum_some(numbers, indices):
    """Просуммировать только числа по указанным индексам"""
    pass


def replace_range(a, b, x, y):
    """
    Даны два списка - a и b, а также два числа - x и y.
    Заменить все элементы в диапазоне [x; y] в списке a на содержимое списка b.
    Вернуть получившийся список. Исходные списки a, b менять нельзя.
    replace_range([1, 2, 3, 4], [7, 8, 9], 0, 1) -> [7, 8, 9, 3, 4]
    """
    pass


def sum_list(a):
    """
    РЕКУРСИВНО просуммировать элементы входного списка a и вернуть их сумму.
    Гарантируется, что все элементы массива - целые числа.
    Для пустого списка вернуть 0.
    sum_list([1, 2, 3]) -> 6
    """
    pass


def signs(a):
    """
    Дан список a, хранящий числа.
    Вернуть его же, но между числами расставить знаки '>', '<', '='
    signs([2, 8, 4, 4]) -> [2, '<', 8, '>', 4, '=', 4]
    """
    pass
