def sum_some(numbers, indices):
    """
    Вернуть сумму элементов из numbers, на позициях, записанных в indices
    sum_some([1, 2, 3], [0, 1, 1]) -> 5 = (1+2+2)
    """
    pass


def replace_range(a, b, x, y):
    """
    Заменить подмассив массива a с индексами от x до y на массив b
    replace_range([1, 2, 3, 4], [7, 8, 9], 0, 1) -> [7, 8, 9, 3, 4]
    """
    pass


def sum_list(a):
    """
    Рекурсивно просуммировать элементы массива a
    sum_list([1, 2, 3]) -> 6
    """
    pass


def signs(a):
    """
    Расставьте между элементами массива a знаки отношений "меньше", "равно" или "больше"
    signs([2, 8, 4, 4]) -> [2, '<', 8, '>', 4, '=', 4]
    """
    pass
